In [1]:
import pandas as pd
import numpy as np

In [2]:
weather_forecast_dict = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [40, 39, 38]}
weather_forecast_df = pd.DataFrame(weather_forecast_dict)
weather_forecast_df

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [3]:
weather_forecast_df.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [4]:
weather_forecast_df.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [5]:
weather_forecast_dict2 = { "Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25], "Izmir": [40, 39, np.nan], "Antalya": [45, np.nan, np.nan]}
weather_forecast_df2 = pd.DataFrame(weather_forecast_dict2)
weather_forecast_df2

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0   40.0     45.0
1      29.0     NaN   39.0      NaN
2       NaN    25.0    NaN      NaN

In [6]:
weather_forecast_df2.dropna(axis=1, thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0   40.0
1      29.0     NaN   39.0
2       NaN    25.0    NaN

In [7]:
weather_forecast_df2.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0   40.0     45.0
1      29.0    20.0   39.0     20.0
2      20.0    25.0   20.0     20.0

# group by

In [8]:
salary_dict = {"Department": ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"], 
           "Employee": ["Zeus", "Hades", "Poseidon", "Ares", "Hera", "Artemis"], 
            "Salary": [100, 150, 200, 300, 400, 500]}

In [9]:
salary_df = pd.DataFrame(salary_dict)
salary_df

  Department  Employee  Salary
0    Yazılım      Zeus     100
1    Yazılım     Hades     150
2  Pazarlama  Poseidon     200
3  Pazarlama      Ares     300
4      Hukuk      Hera     400
5      Hukuk   Artemis     500

In [10]:
group_object = salary_df.groupby("Department")
type(group_object)

pandas.core.groupby.generic.DataFrameGroupBy

In [11]:
group_object.count()

            Employee  Salary
Department
Hukuk              2       2
Pazarlama          2       2
Yazılım            2       2

In [12]:
group_object.mean()

            Salary
Department
Hukuk          450
Pazarlama      250
Yazılım        125

In [13]:
group_object.max()

            Employee  Salary
Department
Hukuk           Hera     500
Pazarlama   Poseidon     300
Yazılım         Zeus     150

In [14]:
group_object.min()

           Employee  Salary
Department
Hukuk       Artemis     400
Pazarlama      Ares     200
Yazılım       Hades     100

In [15]:
group_object.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
Hukuk         2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama     2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım       2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

# concatenation

In [16]:
dict1 = {"Name": ["Ahmet", "Mehmet", "Zeynep", "Kamil"], 
       "Spor": ["Running", "Swimming", "Running", "Basketball"], 
       "Calory": [100, 200, 300, 400]}

In [17]:
df1 = pd.DataFrame(dict1, index=[0, 1, 2, 3])
df1

     Name        Spor  Calory
0   Ahmet     Running     100
1  Mehmet    Swimming     200
2  Zeynep     Running     300
3   Kamil  Basketball     400

In [18]:
dict2 = {"Name": ["Osman", "Levent", "Ali", "Fatma"], 
       "Spor": ["Running", "Swimming", "Running", "Basketball"], 
      "Calory": [200, 100, 500, 300]}

In [19]:
df2 = pd.DataFrame(dict2, index=[4, 5, 6, 7])
df2

     Name        Spor  Calory
4   Osman     Running     200
5  Levent    Swimming     100
6     Ali     Running     500
7   Fatma  Basketball     300

In [20]:
dict3 = {"Name": ["Ayse", "Mahmut", "Duygu", "Mert"], 
       "Spor": ["Running", "Swimming", "Badminton", "Tennis"], 
      "Calory": [300, 400, 500, 250]}

In [21]:
df3 = pd.DataFrame(dict3, index=[8, 9, 10, 11])
df3

      Name       Spor  Calory
8     Ayse    Running     300
9   Mahmut   Swimming     400
10   Duygu  Badminton     500
11    Mert     Tennis     250

In [22]:
pd.concat([df1, df2, df3], axis=0)

      Name        Spor  Calory
0    Ahmet     Running     100
1   Mehmet    Swimming     200
2   Zeynep     Running     300
3    Kamil  Basketball     400
4    Osman     Running     200
5   Levent    Swimming     100
6      Ali     Running     500
7    Fatma  Basketball     300
8     Ayse     Running     300
9   Mahmut    Swimming     400
10   Duygu   Badminton     500
11    Mert      Tennis     250

# merge

In [23]:
dict1 = {"Name": ["Ahmet", "Mehmet", "Zeynep", "Kamil"], 
       "Spor": ["Running", "Swimming", "Running", "Basketball"]}

In [24]:
df1 = pd.DataFrame(dict1)
df1

     Name        Spor
0   Ahmet     Running
1  Mehmet    Swimming
2  Zeynep     Running
3   Kamil  Basketball

In [25]:
dict2 = {"Name": ["Ahmet", "Mehmet", "Zeynep", "Kamil"], 
             "Calory": [100, 200, 300, 400]}
df2 = pd.DataFrame(dict2)
df2

     Name  Calory
0   Ahmet     100
1  Mehmet     200
2  Zeynep     300
3   Kamil     400

In [26]:
pd.merge(df1, df2, on="Name")

     Name        Spor  Calory
0   Ahmet     Running     100
1  Mehmet    Swimming     200
2  Zeynep     Running     300
3   Kamil  Basketball     400

In [27]:
salary_dict = {"Name": ["Zeus", "Hades", "Poseidon", "Hera"], 
            "Department": ["Yazılım", "Satıs", "Pazarlama", "Yazılım"],           
            "Salary": [200, 300, 400, 500]
           }

In [28]:
salary_df = pd.DataFrame(salary_dict)
salary_df

       Name Department  Salary
0      Zeus    Yazılım     200
1     Hades      Satıs     300
2  Poseidon  Pazarlama     400
3      Hera    Yazılım     500

In [29]:
salary_df["Department"].unique()

array(['Yazılım', 'Satıs', 'Pazarlama'], dtype=object)

In [30]:
salary_df["Department"].nunique()

3

In [31]:
salary_df["Department"].value_counts()

Yazılım      2
Satıs        1
Pazarlama    1
Name: Department, dtype: int64

In [32]:
def net_salary(salary):
    return salary * 0.66

In [33]:
salary_df["Salary"].apply(net_salary)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Salary, dtype: float64

In [34]:
salary_df.isnull()

    Name  Department  Salary
0  False       False   False
1  False       False   False
2  False       False   False
3  False       False   False

# pivot_table

In [35]:
data1 = {"Cartoon": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"], 
      "Character": ["Cartman", "Kenny", "Homer", "Bart", "Bart"], 
       "Age": [9, 10, 50, 20, 10]
      }

In [36]:
cartoon_df = pd.DataFrame(data1)
cartoon_df

      Cartoon Character  Age
0  South Park   Cartman    9
1  South Park     Kenny   10
2     Simpson     Homer   50
3     Simpson      Bart   20
4     Simpson      Bart   10

In [37]:
cartoon_df.pivot_table(values="Age", index=["Cartoon", "Character"], aggfunc=np.sum)

                      Age
Cartoon    Character
Simpson    Bart        30
           Homer       50
South Park Cartman      9
           Kenny       10

In [38]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
...                          "bar", "bar", "bar", "bar"],
...                    "B": ["one", "one", "one", "two", "two",
...                          "one", "one", "two", "two"],
...                    "C": ["small", "large", "large", "small",
...                          "small", "large", "small", "small",
...                          "large"],
...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [39]:
# table = pd.pivot_table(df, values='D', index=['A', 'B'],columns=['C'], aggfunc=np.sum)
# table
df.pivot_table(values='D', index=['A', 'B'],columns=['C'], aggfunc=np.sum)

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0